app/Controllers/Register.php

SELECT *
FROM `roles`
---
    public function index(): string
    {
        $roleModel = new RoleModel();
        $roles = $roleModel->findAll(); // Récupère tous les rôles de la table 'roles'

INSERT INTO `users` (`nom`, `prenom`, `email`) VALUES ('jwqh', 'hwqhdhwq', 'hwhd@gmail.com')
INSERT INTO `comptes` (`user_id`, `username`, `password`, `role_id`) VALUES (20, 'hamid', '$2y$10$DTLVlanBUhaljOUDSkQUd.RzEAI.YU9ZP4jTkUfcdgw3HY1wWC77.', '1')
---
    public function processRegister()
{
    // Charger les modèles nécessaires
    $userModel = new UserModel();
    $compteModel = new CompteModel();
    $roleModel = new RoleModel();

    // Récupérer les données du formulaire
    $nom = $this->request->getPost('nom');
    $prenom = $this->request->getPost('prenom');
    $email = $this->request->getPost('email');
    $username = $this->request->getPost('username');
    $password = $this->request->getPost('password'); // Mot de passe sans hachage
    $role_id = $this->request->getPost('role'); // Récupérer le nom du rôle

    // Vérifier si toutes les données sont présentes
    if (empty($nom) || empty($prenom) || empty($email) || empty($username) || empty($password) || empty($role_id)) {
        return redirect()->back()->with('error', 'Tous les champs sont obligatoires.');
    }

    // Hacher le mot de passe avant de le sauvegarder
    $hashedPassword = password_hash($password, PASSWORD_DEFAULT);

    // Commencer une transaction
    $db = \Config\Database::connect();
    $db->transStart();

    try {
        // Insérer l'utilisateur dans la table 'users'
        $userId = $userModel->insert([
            'nom' => $nom,
            'prenom' => $prenom,
            'email' => $email,
        ], true); // Retourne l'ID de l'utilisateur inséré

        // Insérer le compte dans la table 'comptes' avec le mot de passe haché
        $compteModel->insert([
            'user_id' => $userId,
            'username' => $username,
            'password' => $hashedPassword, // Enregistrement du mot de passe haché
            'role_id' => $role_id,
        ]);